# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Maybe further truncated see logs for complete plan output]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azuread_application.prometheus will be created
  + resource "azuread_application" "prometheus" {
      + app_role_ids                = (known after apply)
      + client_id                   = (known after apply)
      + disabled_by_microsoft       = (known after apply)
      + display_name                = "adminservicestest-k6tests-prometheus"
      + id                          = (known after apply)
      + logo_url                    = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + object_id                   = (known after apply)
      + prevent_duplicate_names     = false
      + publisher_domain            = (known after apply)
      + sign_in_audience            = "AzureADMyOrg"
      + tags                        = (known after apply)
      + template_id                 = (known after apply)

      + feature_tags (known after apply)

      + password (known after apply)
    }

  # azuread_application_federated_identity_credential.prometheus will be created
  + resource "azuread_application_federated_identity_credential" "prometheus" {
      + application_id = (known after apply)
      + audiences      = [
          + "api://AzureADTokenExchange",
        ]
      + credential_id  = (known after apply)
      + display_name   = "adminservicestest-k6tests-prometheus"
      + id             = (known after apply)
      + issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/3959c3be-9ff5-42a3-8665-6b8c7260a7f4/"
      + subject        = "system:serviceaccount:monitoring:kube-prometheus-stack-prometheus"
    }

  # azuread_service_principal.prometheus will be created
  + resource "azuread_service_principal" "prometheus" {
      + account_enabled             = true
      + app_role_ids                = (known after apply)
      + app_roles                   = (known after apply)
      + application_tenant_id       = (known after apply)
      + client_id                   = (known after apply)
      + display_name                = (known after apply)
      + homepage_url                = (known after apply)
      + id                          = (known after apply)
      + logout_url                  = (known after apply)
      + oauth2_permission_scope_ids = (known after apply)
      + oauth2_permission_scopes    = (known after apply)
      + object_id                   = (known after apply)
      + redirect_uris               = (known after apply)
      + saml_metadata_url           = (known after apply)
      + service_principal_names     = (known after apply)
      + sign_in_audience            = (known after apply)
      + tags                        = (known after apply)
      + type                        = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

  # azurerm_kubernetes_cluster.k6tests will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "k6tests" {
        id                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster"
        name                                = "k6tests-cluster"
        tags                                = {}
        # (31 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (30 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # azurerm_kubernetes_cluster_node_pool.spot will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "spot" {
        id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster/agentPools/spot"
        name                          = "spot"
      ~ node_labels                   = {
          - "kubernetes.azure.com/scalesetpriority" = "spot" -> null
            # (1 unchanged element hidden)
        }
      ~ node_taints                   = [
          - "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
        tags                          = {}
        # (29 unchanged attributes hidden)
    }

  # azurerm_role_assignment.monitoring_metrics_publisher will be created
  + resource "azurerm_role_assignment" "monitoring_metrics_publisher" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Metrics Publisher"
      + scope                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/k6tests-amw"
      + skip_service_principal_aad_check = (known after apply)
    }

  # helm_release.kube_prometheus_stack will be updated in-place
  ~ resource "helm_release" "kube_prometheus_stack" {
        id                         = "kube-prometheus-stack"
      ~ metadata                   = [
          - {
              - app_version    = "v0.78.2"
              - chart          = "kube-prometheus-stack"
              - first_deployed = 1733406099
              - last_deployed  = 1733406099
              - name           = "kube-prometheus-stack"
              - namespace      = "monitoring"
              - notes          = <<-EOT
                    kube-prometheus-stack has been installed. Check its status by running:
                      kubectl --namespace monitoring get pods -l "release=kube-prometheus-stack"
                    
                    Visit https://github.com/prometheus-operator/kube-prometheus for instructions on how to create & configure Alertmanager and Prometheus instances using the Operator.
                    
                    kube-state-metrics is a simple service that listens to the Kubernetes API server and generates metrics about the state of the objects.
                    The exposed metrics can be found here:
                    https://github.com/kubernetes/kube-state-metrics/blob/master/docs/README.md#exposed-metrics
                    
                    The metrics are exported on the HTTP endpoint /metrics on the listening port.
                    In your case, kube-prometheus-stack-kube-state-metrics.monitoring.svc.cluster.local:8080/metrics
                    
                    They are served either as plaintext or protobuf depending on the Accept header.
                    They are designed to be consumed either by Prometheus itself or by a scraper that is compatible with scraping a Prometheus client endpoint.
                    
                    1. Get the application URL by running these commands:
                      export POD_NAME=
                      echo "Visit http://127.0.0.1:9100 to use your application"
                      kubectl port-forward --namespace monitoring  9100
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - alertmanager = {
                          - enabled = true
                        }
                      - crds         = {
                          - enabled = false
                        }
                      - grafana      = {
                          - enabled = false
                        }
                      - prometheus   = {
                          - enabled        = true
                          - prometheusSpec = {
                              - externalLabels    = {
                                  - cluster = "k6tests-cluster"
                                }
                              - priorityClassName = "system-cluster-critical"
                              - retention         = "1d"
                              - storageSpec       = {
                                  - volumeClaimTemplate = {
                                      - spec = {
                                          - resources = {
                                              - requests = {
                                                  - storage = "5Gi"
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                )
              - version        = "66.3.1"
            },
        ] -> (known after apply)
        name                       = "kube-prometheus-stack"
      ~ values                     = [
          - <<-EOT
                crds:
                  enabled: false
                alertmanager:
                  enabled: true
                grafana:
                  enabled: false
                prometheus:
                  enabled: true
                  prometheusSpec:
                    externalLabels:
                      cluster: "k6tests-cluster"
                    priorityClassName: "system-cluster-critical"
                    retention: 1d
                    storageSpec:
                      volumeClaimTemplate:
                        spec:
                          resources:
                            requests:
                              storage: 5Gi
            EOT,
        ] -> (known after apply)
        # (26 unchanged attributes hidden)
    }

  # helm_release.sealed_secrets will be created
  + resource "helm_release" "sealed_secrets" {
      + atomic                     = false
      + chart                      = "sealed-secrets"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sealedsecrets"
      + namespace                  = "sealedsecrets-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://bitnami-labs.github.io/sealed-secrets"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.17.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 5 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/altinn-monitor-test-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/altinn-monitor-test-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_altinn-monitor-test-rg.tfstate.tfplan`